# SpacePeopleActivityLevelParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpacePeopleActivityLevelParam Property
ParameterTypeId Class See Also
---
"People Activity Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpacePeopleActivityLevelParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpacePeopleActivityLevelParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpacePeopleActivityLevelParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace